using System;


namespace ScriptEditor
{
    //==================================================================================
    // ->  サウンド（ボイス）をコンペンドが保持する
    // ->  アクションとエフェクトを同一化する
    // ->  共通アクション
    // ->  他スクリプト項目の増減
    //==================================================================================
    //	キャラ 編集上データ ver 050
    // 
    //	キャラ
    //		┣キャラセット		コモン(共通)	
    //		┣キャラセット		パーソナル(個別)
    // 
    //	キャラセット
    //		┣コンペンド	ビヘイビア
    //		┣コンペンド	ガーニッシュ
    // 
    // ->編集時に分割(名前で分類)し、実行上は統合(ID)する
    // //IDでも、名前指定でも、共通と固有を同列で並べ、参照時に分岐する
    //==================================================================================

    public class CharaSet
    {
        Compend behavior = new Compend ();
        Compend garnish = new Compend ();
    }

    public class Chara
    {
        public void Clear ()
        {

        }
    }
}
